/*
██╗    ██╗██╗ ██████╗██╗  ██╗    ███████╗████████╗██╗   ██╗██████╗ ██╗ ██████╗ 
██║    ██║██║██╔════╝██║ ██╔╝    ██╔════╝╚══██╔══╝██║   ██║██╔══██╗██║██╔═══██╗
██║ █╗ ██║██║██║     █████╔╝     ███████╗   ██║   ██║   ██║██║  ██║██║██║   ██║
██║███╗██║██║██║     ██╔═██╗     ╚════██║   ██║   ██║   ██║██║  ██║██║██║   ██║
╚███╔███╔╝██║╚██████╗██║  ██╗    ███████║   ██║   ╚██████╔╝██████╔╝██║╚██████╔╝
 ╚══╝╚══╝ ╚═╝ ╚═════╝╚═╝  ╚═╝    ╚══════╝   ╚═╝    ╚═════╝ ╚═════╝ ╚═╝ ╚═════╝ 
Copyright (c) 2024 Wick Studio
*/

module.exports = {
    clientId: "1212347317793857546", // ايدي البوت
    guildId: "992554457789370378", // ايدي السيرفر
    thumbnail: "https://media.discordapp.net/attachments/1203067988635557918/1235156057911726080/Icon_Emoji_Paimons_Paintings_29_Furina_1.png?ex=66335838&is=663206b8&hm=7f45a6bb1f48dd5c73e0f0c049d9472108c20fe44880f689947fdf964e5aa088&=&format=webp&quality=lossless", // الصورة المصغرة
    image: "https://media.discordapp.net/attachments/1203067988635557918/1235141925976277023/7e754c284f101acf.png?ex=66334b0e&is=6631f98e&hm=e8e946d46be3aaf878d83b11375d67dce5eae3c250b756fedbdbe4005167c59b&=&format=webp&quality=lossless", // صورة الامبد الكبيرة
    footer: "https://media.discordapp.net/attachments/1203067988635557918/1235156418357624892/294b17140531249c118d246a06c165d7.png?ex=6633588e&is=6632070e&hm=0fbc6f0efc0e3a64ec4bf601e39cd1983b456d8912088e01e569aa905cbdf791&=&format=webp&quality=lossless&width=671&height=671", // صورة مصغرة للفوتر
    roles: {
      section1: {
        label: "اختر اشعاراتك", // اسم القسم الاول
        description: "اختر كل اشعارت الي تبيه يوصلك", // وصف القسم
        roles: [
          { label: "اشعارات يوتيوب وبثوث سموكي", value: "999225913176752170" }, // role_name = اسم الرتبة | role_id = ايدي الرتبة
          { label: "اخبار السيرفر", value: "999226728079691847" }, // role_name = اسم الرتبة | role_id = ايدي الرتبة
          { label: "اشعار فعاليات", value: "999228285869371422" }, // role_name = اسم الرتبة | role_id = ايدي الرتبة
        ]
      },
      section2: {
        label: "اختر اقسامك", // اسم القسم الثاني
        description: "اختر اقسامك للأظهار رومات", // وصف القسم
        roles: [
          { label: "شات انمي والمانجا", value: "1101480370874105876" }, // role_name = اسم الرتبة | role_id = ايدي الرتبة
          { label: "قسم للأستعراض ادت", value: "999231303029379092" }, // role_name = اسم الرتبة | role_id = ايدي الرتبة
          { label: "مهارات", value: "999230664983461898" }, // role_name = اسم الرتبة | role_id = ايدي الرتبة
        ]
      },
      section3: {
        label: "اختر العابك", // اسم القسم الثالث
        description: "اختر العابك المفضلة للأظهار قسم العابك", // وصف القسم
        roles: [
          { label: "قنشن امباكت", value: "992969449495871500" }, // role_name = اسم الرتبة | role_id = ايدي الرتبة
          { label: "هونكاي ستار ريل", value: "1101271427342155826" }, // role_name = اسم الرتبة | role_id = ايدي الرتبة
        ]
      },
      section4: {
        label: "اختر سيرفراتك", // اسم القسم الثالث
        description: "اختر سيرفرك لتلقي طلبات مساعدة", // وصف القسم
        roles: [
          { label: "اوربا", value: "992977415959748800" }, // role_name = اسم الرتبة | role_id = ايدي الرتبة
          { label: "اسيا", value: "992977588995760248" }, // role_name = اسم الرتبة | role_id = ايدي الرتبة
          { label: "امريكا", value: "992977774358843462" }, // role_name = اسم الرتبة | role_id = ايدي الرتبة

        ]
      },
    }
  };
  
